# SQL Transactions: COMMIT and ROLLBACK

In Oracle SQL, **transactions** allow you to group multiple operations into a single unit of work. 
- `COMMIT`: Saves all changes made in the current transaction permanently.
- `ROLLBACK`: Undoes changes made in the current transaction, restoring the database to the last committed state.

We will demonstrate this with an `Accounts` table.

In [ ]:
DROP TABLE Accounts;

In [ ]:
CREATE TABLE Accounts (
    AccID NUMBER PRIMARY KEY,
    HolderName VARCHAR2(50),
    Balance NUMBER(10,2)
);

When we insert rows and use `COMMIT`, the data is permanently stored.

In [ ]:
INSERT INTO Accounts VALUES (1, 'Arjun Sharma', 5000);

In [ ]:
INSERT INTO Accounts VALUES (2, 'Priya Nair', 7000);

In [ ]:
SELECT * FROM Accounts;

In [ ]:
COMMIT;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
INSERT INTO Accounts VALUES (3, 'Ramesh Iyer', 6000);

In [ ]:
SELECT * FROM Accounts;

In [ ]:
ROLLBACK;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
UPDATE Accounts SET Balance = 8000 WHERE AccID = 1;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
ROLLBACK;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
UPDATE Accounts SET Balance = 9000 WHERE AccID = 2;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
COMMIT;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
ROLLBACK;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
DELETE FROM ACCOUNTS;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
ROLLBACK;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
DELETE FROM ACCOUNTS;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
COMMIT;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
ROLLBACK;

In [ ]:
SELECT * FROM Accounts;

In [ ]:
DROP TABLE ACCOUNTS;